Autodesk.Revit.DB.TextListStyle
Since:
2016
Supported styles of text list paragraphs.
Since:
2016

Autodesk.Revit.DB.TextListStyle.NumberRomanUppercase
Indicates a list that uses uppercase Roman numbers.

Autodesk.Revit.DB.TextListStyle.NumberRomanLowercase
Indicates a list that uses lowercase Roman numbers.

Autodesk.Revit.DB.TextListStyle.LetterUppercase
Indicates a list that uses uppercase letters.

Autodesk.Revit.DB.TextListStyle.LetterLowercase
Indicates a list that uses lowercase letters.

Autodesk.Revit.DB.TextListStyle.NumberArabic
Indicates a list that uses arabic numbers.

Autodesk.Revit.DB.TextListStyle.Bullet
Indicates a list that uses standard bullets.

Autodesk.Revit.DB.TextListStyle.None
Indicates that the paragraph is not a list.